# Інструментарій Django для роботи з формами
from django import forms
from django.core.exceptions import ValidationError
import re   # regular expressions

# класи-форми описують склад форм у вигляді спеціальних елементів
class DeliveryForm(forms.Form) :
    first_name = forms.CharField(
        min_length=2, 
        max_length=64, 
        label="Ім'я",
        error_messages={
            'required': "Необхідно ввести ім'я",
            'min_length': "Ім'я повинно мати щонайменше 2 символи",
            'max_length': "Ім'я не повинно перевищувати 64 символи"
        })
    
    country = forms.ChoiceField(
        choices=[
            ("ua", "Україна"), 
            ("pl", "Польша"), 
            ("cz", "Чехія")]
    )


'''
Д.З. Завершити роботу з формою "замовлення" (delivery)
- валідація дати доставки - має бути у майбутньому, щонайменше через добу
- час - має відповідати робочому проміжку (наприклад, 9:00-18:00)
- поштовий код (індекс) - складається тільки з цифр
- імена та власні назви (місто, область, вулиця) - починаються з великої літери
У випадку успішного заповнення форми на сторінці має відобразитись 
підтвердження (замість форми) з усіма введеними даними:
ПРИЙНЯТЕ ЗАМОВЛЕННЯ
одержувач - ....
адреса - ... (поєднані код, країна, місто, адреса,...)
дата, час - ....
'''